let messages = [
  {
    id: 1,
    author: 'Алви',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:29'
  },
  {
    id: 2,
    author: 'Арсан',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:30'
  },
  {
    id: 3,
    author: 'Аслан',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:31'
  },
  {
    id: 4,
    author: 'Рамзан',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:32'
  },
  {
    id: 5,
    author: 'Ризван',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:33'
  },
  {
    id: 6,
    author: 'Супьян',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:34'
  },
  {
    id: 7,
    author: 'Висита',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:35'
  },
  {
    id: 8,
    author: 'Умар',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:36'
  },
  {
    id: 9,
    author: 'Увайс',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:37'
  },
  {
    id: 10,
    author: 'Хамзат',
    text: 'Приветики🥰',
    type: 'входящее',
    time: '12:39'
  },
];
console.log(messages)